Revit 2026 API

# DirectContext3DHandleOverridesAssign Method

---

Assigns values of the source overrides to this object.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Assign(
	DirectContext3DHandleOverrides other
)
```
```vb
Public Sub Assign (
	other As DirectContext3DHandleOverrides
)
```
```cpp
public:
void Assign(
	DirectContext3DHandleOverrides^ other
)
```
```fsharp
member Assign :
        other : DirectContext3DHandleOverrides -> unit
```

#### Parameters

other DirectContext3DHandleOverrides
     The source overrides.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DirectContext3DHandleOverrides Class

Autodesk.Revit.DB.DirectContext3D Namespace